Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum
Defines the different material item types.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_UNKNOWN
The unknown material item type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_STEEL
The steel material type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_CONCRETE
The concrete material type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_TIMBER
The timber material type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_MISC
The miscellaneous material type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_REBAR
The rebar material type.

Tekla.Structures.Catalogs.MaterialItem.MaterialItemTypeEnum.MATERIAL_REBAR_MESH
The rebar mesh material type.